cyliner_snappyLaminar/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    // default         cellMDLimited Gauss linear 0;
    // grad(U)         cellMDLimited Gauss linear 0.333;    
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinearV 1;
    // div(phi,U)      Gauss linearUpwind grad(U);
    // div(phi,U)      Gauss CoBlended
    //                     0.01                  // Co below which scheme1 is used
    //                     limitedLinearV 1      // scheme1
    //                     0.05                  // Co above which scheme2 is used
    //                     linearUpwind grad(U); // scheme2
    // turbulence      Gauss linearUpwind default;
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,omega)  Gauss limitedLinear 1;
    div(phi,R)      Gauss limitedLinear 1;
    div(R)          Gauss linear;
    div(U)          Gauss linear;             // enables div function object
    div(phi,nuTilda) Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
